// Основные инструменты, который разраб использует на работе каждый день:
// 1. visual code c плагинами;
// 2. npm (В прошлом уроке) / yarn, pnpm,
// 3. Браузеры (все популярные);
// 4. console (Терминал)
// 5. Консоль разработчика в браузере;
// 6. Git
// 7. TaskManager(основной - Jira) ** - погуглить!!!!!
// 8. agile - гибкая методология разработки ПО (ПОЧИТАТЬ!!!!!!!: scrum, что такое agile и какие подходы есть)
// 9. Figma
// 10. Github / gitlab / bitbucket ** ГУГЛИТЬ
// 11. Корпоративный мессенджер - mattermost | slack
// 12. Корпоративная почта
// 13. Инструменты мониторинга
// 14. Node.js
// 15. Postman - гуглить!
// 16. Инстр-ты контейнеризации: Docker или Podman и др


// Что обязательно должно быть настроено в проекте (в зависимости от размера проекта):
// 1. react, react-dom, react-router и др (необязательно, но самая популярная)
// 2. webpack (сборщик проекта) - в зависимости от размера проекта
// 3. redux и др. (state-менеджеры) - в зависимости от размера проекта
// 4. axios - удобный инструмент для работы с сетевыми запросами
// 5. typescript - язык статической типизации
// 6. линтеры - ESlint, TSlint - инструменты для поиска ошибок в коде
// 7. форматеры - Prettier
// 8. Сборка приложения (локальная и продуктовая)
// 9. Стилизация: styled components или cssInJs или sass и др
// 10. Unit-тесты (самый низкий приоритет в чтении)

