// npm - node js package manager. Помогает работать с open source (и не только) библиотеками. Их можно устанавливать из реестра пакетов по-умолчанию, либо из своего реестра, если такой имеется.

// npm start
// npm install - устанавливает пакет (бибилиотеку) из registry по-умолчанию: https://registry.npmjs.org/
// искать npm-пакеты можно тут: https://www.npmjs.com/

// Помимо npm есть и другие менеджеры пакетов, с помощью которых можно работать с зависимостями
// Например: yarn, yarn2, pnpm.
// Они работают быстрее npm и позиционируются как более шустрые и модные

// Когда мы инициализируем новый npm-проект, у нас появляется файл package.json. Это конфиг, который хранит в себе информацию о проекте и его зависимостях в формате .json.

// Для npm пакетов существует система версионирования: semver или семантическое версионирование (https://semver.org/lang/ru/)

// Освновные команды:
// npm istall - установить пакет
// npm remove - удалить пакет
// npm ls - показать все пакеты, версии и зависимости
// Все команды здесь: https://docs.npmjs.com/cli/v8/commands
